package javahomework.a20_YiSoyoung.a0426;
/* 정리 및 확인하고
 * 자바의 상속에 대한 설명 중 틀린 것은 무엇입니까?①
 	① 다중 상속을 허용한다
 	② 부모의 메소드를 자식클래스에서 재정의 할 수 있다
 	③ 부모의 private 접근 제한을 갖는 필드와 메소드는 상속 대상이 아니다
 	④ final 클래스는 상속할 수 없고, final 메소드는 오버라이딩 할 수 없다
 * 오버라이딩에 대한 설명으로 틀린 것은?③ 
 	① 부모 메서드의 스그니쳐(타입, 메소드명, 매개변수)와 동일해야 한다
 	② 부모 메서드보다 좁은 접근 제한자를 붙일 수 없다(public-부모, private-자식)
 	③ protected 접근 제한을 갖는 메소드는 다른 패키지의 자식 클래스에서 재정의 할 수 없다
* final 키워드에 대한 설명으로 틀린 것은? ①
 	① final 클래스는 부모 클래스로 사용할 수 있다.
 	② final 필드는 값이 저장된 후 변경할 수 없다
 	③ final 메소드는 재정의(오버라이딩)할 수 없다
 	④ static final 필드는 상수를 말한다
 * 인터페이스에 대한 설명으로 틀린 것은? ④
 	① 인터페이스는 객체 사용설명서 역할을 한다.
 	② 구현 클래스가 인터페이스의 추상 메소드에 대한 실제 메소드를 가지고 있지 
 		않으며(- 오타:면으로 바꿔야) 추상 클래스가 된다. 
 	② 구현 클래스가 인터페이스의 추상 메소드에 대한 실제 메소드를 가지고 있지 
 		않으면 추상 클래스가 된다.
 	③ 인터페이스는 인스턴스 필드를 가질 수 있다 - annonymous면 가능
 	④ 구현 객체는 인터페이스 타입으로 자동 변환된다.
 * 
 * 
 * */
public class A16_summary_Homework {

}
